import { GrYoutube } from "react-icons/gr";
import { RiInstagramFill } from "react-icons/ri";
import { RiFacebookBoxFill } from "react-icons/ri";

import DogCateg1 from "@/public/images/dogs/dog-categ-1.png";
import DogCateg2 from "@/public/images/dogs/dog-categ-2.png";
import DogCateg3 from "@/public/images/dogs/dog-categ-3.png";
import DogCateg4 from "@/public/images/dogs/dog-categ-4.png";
import HeroSlideImage1 from "@/public/images/dogs/dog-slide-1.png";
import HeroSlideImage2 from "@/public/images/dogs/dog-slide-2.png";
import HeroSlideImage3 from "@/public/images/dogs/dog-slide-3.png";

export const navList = [
  {
    label: "головна",
    href: "/",
  },
  {
    label: "ціни",
    href: "#prices",
  },
  {
    label: "контакти",
    href: "#contact",
  },
  {
    label: "запис на прийом",
    href: "#",
  },
];

export const heroSliderList = [
  {
    id: "1",
    title: "Піклуємось про вашого улюбленця!",
    image: HeroSlideImage1,
    subtitle:
      "Професійний догляд, вигул та грумінг. Ваша собака отримає найкращий сервіс з любов’ю та турботою.",
    buttonText: "Записатися",
  },
  {
    id: "2",
    title: "Комфорт та безпека на першому місці",
    image: HeroSlideImage2,
    subtitle:
      "Наші спеціалісти забезпечують спокійний догляд, адаптований до потреб вашого улюбленця.",
    buttonText: "Записатися",
  },
  {
    id: "3",
    title: "Якісні послуги для щасливих хвостиків",
    image: HeroSlideImage3,
    subtitle:
      "Ми використовуємо лише перевірені методи догляду та створюємо дружню атмосферу для кожного собаки.",
  },
];

export const priceList = [
  {
    id: "1",
    image: DogCateg1,
    title: "кишенькові зірки",
    dogCategory: "1–9 кг",
    services: [
      {
        subtitle: "хвостатий мінімум",
        price: 300,
        list: [
          "гігієнічне купання",
          "стрижка та розчісування",
          "обрізання кігтів",
          "чищення вух",
          "обробка від паразитів",
        ],
      },
      {
        subtitle: "VIP-лапки",
        price: 500,
        list: [
          "+ 'хвостатий мінімум'",
          "SPA-процедури",
          "експрес-линька",
          "фарбування шерсті",
          "професійна чистка зубів",
        ],
      },
      {
        subtitle: "гламурний хвіст",
        price: 800,
        list: [
          "+ 'VIP-лапки'",
          "масаж для собак",
          "індивідуальний підбір косметики",
          "гідромасажна ванна",
          "дизайнерські аксесуари",
          "преміум-догляд за лапками",
        ],
      },
    ],
  },
  {
    id: "2",
    title: "жваві компаньйони",
    image: DogCateg2,
    dogCategory: "10–19 кг",
    services: [
      {
        subtitle: "хвостатий мінімум",
        price: 400,
        list: [
          "гігієнічне купання",
          "стрижка та розчісування",
          "обрізання кігтів",
          "чищення вух",
          "обробка від паразитів",
        ],
      },
      {
        subtitle: "VIP-лапки",
        price: 650,
        list: [
          "+ 'хвостатий мінімум'",
          "SPA-процедури",
          "експрес-линька",
          "фарбування шерсті",
          "професійна чистка зубів",
        ],
      },
      {
        subtitle: "гламурний хвіст",
        price: 1000,
        list: [
          "+ 'VIP-лапки'",
          "масаж для собак",
          "індивідуальний підбір косметики",
          "гідромасажна ванна",
          "дизайнерські аксесуари",
          "преміум-догляд за лапками",
        ],
      },
    ],
  },
  {
    id: "3",
    title: "могутні лапи",
    image: DogCateg3,
    dogCategory: "20–29 кг",
    services: [
      {
        subtitle: "хвостатий мінімум",
        price: 500,
        list: [
          "гігієнічне купання",
          "стрижка та розчісування",
          "обрізання кігтів",
          "чищення вух",
          "обробка від паразитів",
        ],
      },
      {
        subtitle: "VIP-лапки",
        price: 800,
        list: [
          "+ 'хвостатий мінімум'",
          "SPA-процедури",
          "експрес-линька",
          "фарбування шерсті",
          "професійна чистка зубів",
        ],
      },
      {
        subtitle: "гламурний хвіст",
        price: 1200,
        list: [
          "+ 'VIP-лапки'",
          "масаж для собак",
          "індивідуальний підбір косметики",
          "гідромасажна ванна",
          "дизайнерські аксесуари",
          "преміум-догляд за лапками",
        ],
      },
    ],
  },
  {
    id: "4",
    title: "королі двору",
    image: DogCateg4,
    dogCategory: "30–39 кг",
    services: [
      {
        subtitle: "хвостатий мінімум",
        price: 600,
        list: [
          "гігієнічне купання",
          "стрижка та розчісування",
          "обрізання кігтів",
          "чищення вух",
          "обробка від паразитів",
        ],
      },
      {
        subtitle: "VIP-лапки",
        price: 1000,
        list: [
          "+ 'хвостатий мінімум'",
          "SPA-процедури",
          "експрес-линька",
          "фарбування шерсті",
          "професійна чистка зубів",
        ],
      },
      {
        subtitle: "гламурний хвіст",
        price: 1500,
        list: [
          "+ 'VIP-лапки'",
          "масаж для собак",
          "індивідуальний підбір косметики",
          "гідромасажна ванна",
          "дизайнерські аксесуари",
          "преміум-догляд за лапками",
        ],
      },
    ],
  },
];

export const socialList = [
  {
    label: "Facebook",
    icon: RiFacebookBoxFill,
    href: "https://www.facebook.com",
  },
  {
    label: "Instagram",
    icon: RiInstagramFill,
    href: "https://www.instagram.com",
  },
  {
    label: "Youtube",
    icon: GrYoutube,
    href: "https://www.youtube.com",
  },
];

// export const priceList = [
//   {
//     id: "1",
//     image: DogCateg1,
//     title: "кишенькові зірки",
//     dogCategory: "1–9 кг",
//     services: [
//       {
//         subtitle: "хвостатий мінімум",
//         price: 300,
//         list: [
//           "гігієнічне купання (ретельне миття з використанням спеціальних шампунів)",
//           "стрижка та розчісування (догляд за шерстю відповідно до породи та побажань власника)",
//           "обрізання кігтів (безпечне підстригання кігтів для комфорту та здоров’я лап)",
//           "чищення вух (видалення забруднень та профілактика запалень)",
//           "обробка від паразитів (використання засобів від бліх, кліщів та гельмінтів)",
//         ],
//       },
//       {
//         subtitle: "VIP-лапки",
//         price: 500,
//         list: [
//           "усі послуги 'хвостатий мінімум'",
//           "спа-процедури (зволожуючі маски для шерсті та ароматерапія)",
//           "експрес-линька (інтенсивне вичісування для зменшення линьки)",
//           "фарбування шерсті (безпечне тонування або акцентні кольорові пасма)",
//           "професійна чистка зубів (догляд за ротовою порожниною для здоров’я зубів і ясен)",
//         ],
//       },
//       {
//         subtitle: "гламурний хвіст",
//         price: 800,
//         list: [
//           "усі послуги 'VIP-лапки'",
//           "масаж для собак (розслабляючі процедури для зняття напруги та покращення кровообігу)",
//           "індивідуальний підбір косметики (вибір засобів догляду відповідно до типу шерсті та шкіри)",
//           "гідромасажна ванна (розслаблююча процедура з ніжними водяними струменями для покращення кровообігу та зняття напруги)",
//           "дизайнерські аксесуари (підбір та примірка стильних бандан, нашийників або бантиків для довершеного образу)",
//           "преміум-догляд за лапками (живильні маски та спеціальні засоби для пом'якшення подушечок лап та їхнього захисту)",
//         ],
//       },
//     ],
//   },
//   {
//     id: "2",
//     title: "жваві компаньйони",
//     image: DogCateg2,
//     dogCategory: "10–19 кг",
//     services: [
//       {
//         subtitle: "хвостатий мінімум",
//         price: 400,
//         list: [
//           "гігієнічне купання (ретельне миття з використанням спеціальних шампунів)",
//           "стрижка та розчісування (догляд за шерстю відповідно до породи та побажань власника)",
//           "обрізання кігтів (безпечне підстригання кігтів для комфорту та здоров’я лап)",
//           "чищення вух (видалення забруднень та профілактика запалень)",
//           "обробка від паразитів (використання засобів від бліх, кліщів та гельмінтів)",
//         ],
//       },
//       {
//         subtitle: "VIP-лапки",
//         price: 650,
//         list: [
//           "усі послуги 'хвостатий мінімум'",
//           "спа-процедури (зволожуючі маски для шерсті та ароматерапія)",
//           "експрес-линька (інтенсивне вичісування для зменшення линьки)",
//           "фарбування шерсті (безпечне тонування або акцентні кольорові пасма)",
//           "професійна чистка зубів (догляд за ротовою порожниною для здоров’я зубів і ясен)",
//         ],
//       },
//       {
//         subtitle: "гламурний хвіст",
//         price: 1000,
//         list: [
//           "усі послуги 'VIP-лапки'",
//           "масаж для собак (розслабляючі процедури для зняття напруги та покращення кровообігу)",
//           "індивідуальний підбір косметики (вибір засобів догляду відповідно до типу шерсті та шкіри)",
//           "гідромасажна ванна (розслаблююча процедура з ніжними водяними струменями для покращення кровообігу та зняття напруги)",
//           "дизайнерські аксесуари (підбір та примірка стильних бандан, нашийників або бантиків для довершеного образу)",
//           "преміум-догляд за лапками (живильні маски та спеціальні засоби для пом'якшення подушечок лап та їхнього захисту)",
//         ],
//       },
//     ],
//   },
//   {
//     id: "3",
//     title: "могутні лапи",
//     image: DogCateg3,
//     dogCategory: "20–29 кг",
//     services: [
//       {
//         subtitle: "хвостатий мінімум",
//         price: 500,
//         list: [
//           "гігієнічне купання (ретельне миття з використанням спеціальних шампунів)",
//           "стрижка та розчісування (догляд за шерстю відповідно до породи та побажань власника)",
//           "обрізання кігтів (безпечне підстригання кігтів для комфорту та здоров’я лап)",
//           "чищення вух (видалення забруднень та профілактика запалень)",
//           "обробка від паразитів (використання засобів від бліх, кліщів та гельмінтів)",
//         ],
//       },
//       {
//         subtitle: "VIP-лапки",
//         price: 800,
//         list: [
//           "усі послуги 'хвостатий мінімум'",
//           "спа-процедури (зволожуючі маски для шерсті та ароматерапія)",
//           "експрес-линька (інтенсивне вичісування для зменшення линьки)",
//           "фарбування шерсті (безпечне тонування або акцентні кольорові пасма)",
//           "професійна чистка зубів (догляд за ротовою порожниною для здоров’я зубів і ясен)",
//         ],
//       },
//       {
//         subtitle: "гламурний хвіст",
//         price: 1200,
//         list: [
//           "усі послуги 'VIP-лапки'",
//           "масаж для собак (розслабляючі процедури для зняття напруги та покращення кровообігу)",
//           "індивідуальний підбір косметики (вибір засобів догляду відповідно до типу шерсті та шкіри)",
//           "гідромасажна ванна (розслаблююча процедура з ніжними водяними струменями для покращення кровообігу та зняття напруги)",
//           "дизайнерські аксесуари (підбір та примірка стильних бандан, нашийників або бантиків для довершеного образу)",
//           "преміум-догляд за лапками (живильні маски та спеціальні засоби для пом'якшення подушечок лап та їхнього захисту)",
//         ],
//       },
//     ],
//   },
//   {
//     id: "4",
//     title: "королі двору",
//     image: DogCateg4,
//     dogCategory: "30–39 кг",
//     services: [
//       {
//         subtitle: "хвостатий мінімум",
//         price: 600,
//         list: [
//           "гігієнічне купання (ретельне миття з використанням спеціальних шампунів)",
//           "стрижка та розчісування (догляд за шерстю відповідно до породи та побажань власника)",
//           "обрізання кігтів (безпечне підстригання кігтів для комфорту та здоров’я лап)",
//           "чищення вух (видалення забруднень та профілактика запалень)",
//           "обробка від паразитів (використання засобів від бліх, кліщів та гельмінтів)",
//         ],
//       },
//       {
//         subtitle: "VIP-лапки",
//         price: 1000,
//         list: [
//           "усі послуги 'хвостатий мінімум'",
//           "спа-процедури (зволожуючі маски для шерсті та ароматерапія)",
//           "експрес-линька (інтенсивне вичісування для зменшення линьки)",
//           "фарбування шерсті (безпечне тонування або акцентні кольорові пасма)",
//           "професійна чистка зубів (догляд за ротовою порожниною для здоров’я зубів і ясен)",
//         ],
//       },
//       {
//         subtitle: "гламурний хвіст",
//         price: 1500,
//         list: [
//           "усі послуги 'VIP-лапки'",
//           "масаж для собак (розслабляючі процедури для зняття напруги та покращення кровообігу)",
//           "індивідуальний підбір косметики (вибір засобів догляду відповідно до типу шерсті та шкіри)",
//           "гідромасажна ванна (розслаблююча процедура з ніжними водяними струменями для покращення кровообігу та зняття напруги)",
//           "дизайнерські аксесуари (підбір та примірка стильних бандан, нашийників або бантиків для довершеного образу)",
//           "преміум-догляд за лапками (живильні маски та спеціальні засоби для пом'якшення подушечок лап та їхнього захисту)",
//         ],
//       },
//     ],
//   },
// ];
